common/components/HelperDirectory.php

SELECT * FROM `directory` WHERE `id`='304'
---
        else {
            $id = (isset($post['business']['id']) && $post['business']['id'] > 0) ? $post['business']['id'] : 0;

            $business = Directory::findOne($id);

SELECT * FROM `inserted_directory_category` WHERE `id`='36'
---
                        $inserted_directory_category_id = $c['inserted_directory_category_id'];

                        if (!empty($inserted_directory_id)) {
                            $inserted_directory = InsertedDirectoryCategory::findOne($inserted_directory_id);

INSERT INTO `inserted_directory_category` (`directory_id`, `category_id`) VALUES (304, 31)
UPDATE `inserted_directory_category` SET `category_id`=59 WHERE `id`=36
---
                            $inserted_directory->directory_id = $post['business']['id'];
                            $inserted_directory->category_id = $inserted_directory_category_id;
                        }
                        if (!$inserted_directory->save()) {