common/components/HelperUser.php

        public static function addUser($data, $role) {
            $model = new User();
            $model->name = isset($data['business']['owner_name']) ? $data['business']['owner_name'] : '';
            $model->username = isset($data['business']['owner_email']) ? $data['business']['owner_email'] : '';
            $model->setPassword(rand(10000000, 99999999));
            $model->role = $role;
            $model->email = isset($data['business']['owner_email']) ? $data['business']['owner_email'] : '';
            $model->phone = isset($data['business']['owner_number']) ? $data['business']['owner_number'] : 0;

            return $model->save() ? $model : FALSE;
---
INSERT INTO `user` (`name`, `username`, `password_hash`, `role`, `email`, `phone`, `status`, `created_at`, `updated_at`) VALUES ('Damon Floyd', 'qelysyb@mailinator.net', '$2y$13$eeDzaJZz0dSV535hY.FgWutW9YQPcLZ7SN1OqdvBItZ2cXMc97NkS', 'user', 'qelysyb@mailinator.net', '0', 10, '1583656844', '1583656844')