common/models/LoginForm.php

UPDATE `user` SET `incorrect_login`=0, `updated_at`='1583655292' WHERE `id`=1
---
    public function validatePassword($attribute, $params) {
        if (!$this->hasErrors()) {
            $user = $this->getUser();
            if (!$user || !$user->validatePassword($this->password)) {

                $Xuser = User::findAnyByUsername($this->username);
                if ($Xuser != null) {
                    $Xuser->incorrect_login = $Xuser->incorrect_login + 1;

                    if ($Xuser->incorrect_login > Yii::$app->params['allowed_incorrect_login']) {
                        $Xuser->status = 0;
                        $this->sendEmail();
                    }
                    $Xuser->update();
                }
                $this->addError($attribute, 'Incorrect username or password.');
            }
            else {
                if ($user) {
                    $user->incorrect_login = 0;
                    $user->update();